; domain
(define (domain hanoi)
(:requirements :strips)
(:predicates (clear ?x)
             (on ?x ?y)
             (smaller ?x ?y))

(:action move
:parameters (?disc ?from ?to)
:precondition (and (smaller ?disc ?to) 
                   (on ?disc ?from) 
                   (clear ?disc) 
                   (clear ?to))
:effect  (and (clear ?from) 
              (on ?disc ?to) 
              (not (on ?disc ?from))  
              (not (clear ?to)))
 ))

; problem
(define (problem hanoi1)
    (:domain hanoi)
    (:objects
        peg1
        peg2
        peg3
        yellow_disk
        pink_disk
        green_disk
        blue_disk
        red_disk
        orange_disk
    )
    (:init
        (clear yellow_disk)
        (clear peg2)
        (clear peg3)
        (on yellow_disk pink_disk)
        (on pink_disk green_disk)
        (on green_disk blue_disk)
        (on blue_disk red_disk)
        (on red_disk orange_disk)
        (on orange_disk peg1)

        (smaller yellow_disk peg1)
        (smaller yellow_disk peg2)
        (smaller yellow_disk peg3)
        (smaller pink_disk peg1)
        (smaller pink_disk peg2)
        (smaller pink_disk peg3)
        (smaller green_disk peg1)
        (smaller green_disk peg2)
        (smaller green_disk peg3)
        (smaller blue_disk peg1)
        (smaller blue_disk peg2)
        (smaller blue_disk peg3)
        (smaller red_disk peg1)
        (smaller red_disk peg2)
        (smaller red_disk peg3)
        (smaller orange_disk peg1)
        (smaller orange_disk peg2)
        (smaller orange_disk peg3)

        (smaller yellow_disk pink_disk)
        (smaller yellow_disk green_disk)
        (smaller yellow_disk blue_disk)
        (smaller yellow_disk red_disk)
        (smaller yellow_disk orange_disk)
        (smaller pink_disk green_disk)
        (smaller pink_disk blue_disk)
        (smaller pink_disk red_disk)
        (smaller pink_disk orange_disk)
        (smaller green_disk blue_disk)
        (smaller green_disk red_disk)
        (smaller green_disk orange_disk)
        (smaller blue_disk red_disk)
        (smaller blue_disk orange_disk)
        (smaller red_disk orange_disk)
    )
    (:goal (and 
        (on orange_disk peg3)
        (on red_disk orange_disk)
        (on blue_disk red_disk)
        (on green_disk blue_disk)
        (on pink_disk green_disk)
        (on yellow_disk pink_disk)
    ))
)

; plan
1. (move yellow_disk pink_disk peg2)
   deleted: (on yellow_disk pink_disk) (clear peg2)
   added: (clear pink_disk) (on yellow_disk peg2)
   goals met: 4 of 6
2. (move pink_disk green_disk peg3)
   deleted: (on pink_disk green_disk) (clear peg3)
   added: (clear green_disk) (on pink_disk peg3)
   goals met: 3 of 6
3. (move yellow_disk peg2 pink_disk)
   deleted: (on yellow_disk peg2) (clear pink_disk)
   added: (clear peg2) (on yellow_disk pink_disk)
   goals met: 4 of 6
4. (move green_disk blue_disk peg2)
   deleted: (on green_disk blue_disk) (clear peg2)
   added: (clear blue_disk) (on green_disk peg2)
   goals met: 3 of 6
5. (move yellow_disk pink_disk blue_disk)
   deleted: (on yellow_disk pink_disk) (clear blue_disk)
   added: (clear pink_disk) (on yellow_disk blue_disk)
   goals met: 2 of 6
6. (move pink_disk peg3 green_disk)
   deleted: (on pink_disk peg3) (clear green_disk)
   added: (clear peg3) (on pink_disk green_disk)
   goals met: 3 of 6
7. (move yellow_disk blue_disk pink_disk)
   deleted: (on yellow_disk blue_disk) (clear pink_disk)
   added: (clear blue_disk) (on yellow_disk pink_disk)
   goals met: 4 of 6
8. (move blue_disk red_disk peg3)
   deleted: (on blue_disk red_disk) (clear peg3)
   added: (clear red_disk) (on blue_disk peg3)
   goals met: 3 of 6
9. (move yellow_disk pink_disk blue_disk)
   deleted: (on yellow_disk pink_disk) (clear blue_disk)
   added: (clear pink_disk) (on yellow_disk blue_disk)
   goals met: 2 of 6
10. (move pink_disk green_disk red_disk)
   deleted: (on pink_disk green_disk) (clear red_disk)
   added: (clear green_disk) (on pink_disk red_disk)
   goals met: 1 of 6
11. (move yellow_disk blue_disk pink_disk)
   deleted: (on yellow_disk blue_disk) (clear pink_disk)
   added: (clear blue_disk) (on yellow_disk pink_disk)
   goals met: 2 of 6
12. (move green_disk peg2 blue_disk)
   deleted: (on green_disk peg2) (clear blue_disk)
   added: (clear peg2) (on green_disk blue_disk)
   goals met: 3 of 6
13. (move yellow_disk pink_disk peg2)
   deleted: (on yellow_disk pink_disk) (clear peg2)
   added: (clear pink_disk) (on yellow_disk peg2)
   goals met: 2 of 6
14. (move pink_disk red_disk green_disk)
   deleted: (on pink_disk red_disk) (clear green_disk)
   added: (clear red_disk) (on pink_disk green_disk)
   goals met: 3 of 6
15. (move yellow_disk peg2 pink_disk)
   deleted: (on yellow_disk peg2) (clear pink_disk)
   added: (clear peg2) (on yellow_disk pink_disk)
   goals met: 4 of 6
16. (move red_disk orange_disk peg2)
   deleted: (on red_disk orange_disk) (clear peg2)
   added: (clear orange_disk) (on red_disk peg2)
   goals met: 3 of 6
17. (move yellow_disk pink_disk orange_disk)
   deleted: (on yellow_disk pink_disk) (clear orange_disk)
   added: (clear pink_disk) (on yellow_disk orange_disk)
   goals met: 2 of 6
18. (move pink_disk green_disk red_disk)
   deleted: (on pink_disk green_disk) (clear red_disk)
   added: (clear green_disk) (on pink_disk red_disk)
   goals met: 1 of 6
19. (move yellow_disk orange_disk pink_disk)
   deleted: (on yellow_disk orange_disk) (clear pink_disk)
   added: (clear orange_disk) (on yellow_disk pink_disk)
   goals met: 2 of 6
20. (move green_disk blue_disk orange_disk)
   deleted: (on green_disk blue_disk) (clear orange_disk)
   added: (clear blue_disk) (on green_disk orange_disk)
   goals met: 1 of 6
21. (move yellow_disk pink_disk blue_disk)
   deleted: (on yellow_disk pink_disk) (clear blue_disk)
   added: (clear pink_disk) (on yellow_disk blue_disk)
   goals met: 0 of 6
22. (move pink_disk red_disk green_disk)
   deleted: (on pink_disk red_disk) (clear green_disk)
   added: (clear red_disk) (on pink_disk green_disk)
   goals met: 1 of 6
23. (move yellow_disk blue_disk pink_disk)
   deleted: (on yellow_disk blue_disk) (clear pink_disk)
   added: (clear blue_disk) (on yellow_disk pink_disk)
   goals met: 2 of 6
24. (move blue_disk peg3 red_disk)
   deleted: (on blue_disk peg3) (clear red_disk)
   added: (clear peg3) (on blue_disk red_disk)
   goals met: 3 of 6
25. (move yellow_disk pink_disk blue_disk)
   deleted: (on yellow_disk pink_disk) (clear blue_disk)
   added: (clear pink_disk) (on yellow_disk blue_disk)
   goals met: 2 of 6
26. (move pink_disk green_disk peg3)
   deleted: (on pink_disk green_disk) (clear peg3)
   added: (clear green_disk) (on pink_disk peg3)
   goals met: 1 of 6
27. (move yellow_disk blue_disk pink_disk)
   deleted: (on yellow_disk blue_disk) (clear pink_disk)
   added: (clear blue_disk) (on yellow_disk pink_disk)
   goals met: 2 of 6
28. (move green_disk orange_disk blue_disk)
   deleted: (on green_disk orange_disk) (clear blue_disk)
   added: (clear orange_disk) (on green_disk blue_disk)
   goals met: 3 of 6
29. (move yellow_disk pink_disk orange_disk)
   deleted: (on yellow_disk pink_disk) (clear orange_disk)
   added: (clear pink_disk) (on yellow_disk orange_disk)
   goals met: 2 of 6
30. (move pink_disk peg3 green_disk)
   deleted: (on pink_disk peg3) (clear green_disk)
   added: (clear peg3) (on pink_disk green_disk)
   goals met: 3 of 6
31. (move yellow_disk orange_disk pink_disk)
   deleted: (on yellow_disk orange_disk) (clear pink_disk)
   added: (clear orange_disk) (on yellow_disk pink_disk)
   goals met: 4 of 6
32. (move orange_disk peg1 peg3)
   deleted: (on orange_disk peg1) (clear peg3)
   added: (clear peg1) (on orange_disk peg3)
   goals met: 5 of 6
33. (move yellow_disk pink_disk orange_disk)
   deleted: (on yellow_disk pink_disk) (clear orange_disk)
   added: (clear pink_disk) (on yellow_disk orange_disk)
   goals met: 4 of 6
34. (move pink_disk green_disk peg1)
   deleted: (on pink_disk green_disk) (clear peg1)
   added: (clear green_disk) (on pink_disk peg1)
   goals met: 3 of 6
35. (move yellow_disk orange_disk pink_disk)
   deleted: (on yellow_disk orange_disk) (clear pink_disk)
   added: (clear orange_disk) (on yellow_disk pink_disk)
   goals met: 4 of 6
36. (move green_disk blue_disk orange_disk)
   deleted: (on green_disk blue_disk) (clear orange_disk)
   added: (clear blue_disk) (on green_disk orange_disk)
   goals met: 3 of 6
37. (move yellow_disk pink_disk blue_disk)
   deleted: (on yellow_disk pink_disk) (clear blue_disk)
   added: (clear pink_disk) (on yellow_disk blue_disk)
   goals met: 2 of 6
38. (move pink_disk peg1 green_disk)
   deleted: (on pink_disk peg1) (clear green_disk)
   added: (clear peg1) (on pink_disk green_disk)
   goals met: 3 of 6
39. (move yellow_disk blue_disk pink_disk)
   deleted: (on yellow_disk blue_disk) (clear pink_disk)
   added: (clear blue_disk) (on yellow_disk pink_disk)
   goals met: 4 of 6
40. (move blue_disk red_disk peg1)
   deleted: (on blue_disk red_disk) (clear peg1)
   added: (clear red_disk) (on blue_disk peg1)
   goals met: 3 of 6
41. (move yellow_disk pink_disk blue_disk)
   deleted: (on yellow_disk pink_disk) (clear blue_disk)
   added: (clear pink_disk) (on yellow_disk blue_disk)
   goals met: 2 of 6
42. (move pink_disk green_disk red_disk)
   deleted: (on pink_disk green_disk) (clear red_disk)
   added: (clear green_disk) (on pink_disk red_disk)
   goals met: 1 of 6
43. (move yellow_disk blue_disk pink_disk)
   deleted: (on yellow_disk blue_disk) (clear pink_disk)
   added: (clear blue_disk) (on yellow_disk pink_disk)
   goals met: 2 of 6
44. (move green_disk orange_disk blue_disk)
   deleted: (on green_disk orange_disk) (clear blue_disk)
   added: (clear orange_disk) (on green_disk blue_disk)
   goals met: 3 of 6
45. (move yellow_disk pink_disk orange_disk)
   deleted: (on yellow_disk pink_disk) (clear orange_disk)
   added: (clear pink_disk) (on yellow_disk orange_disk)
   goals met: 2 of 6
46. (move pink_disk red_disk green_disk)
   deleted: (on pink_disk red_disk) (clear green_disk)
   added: (clear red_disk) (on pink_disk green_disk)
   goals met: 3 of 6
47. (move yellow_disk orange_disk pink_disk)
   deleted: (on yellow_disk orange_disk) (clear pink_disk)
   added: (clear orange_disk) (on yellow_disk pink_disk)
   goals met: 4 of 6
48. (move red_disk peg2 orange_disk)
   deleted: (on red_disk peg2) (clear orange_disk)
   added: (clear peg2) (on red_disk orange_disk)
   goals met: 5 of 6
49. (move yellow_disk pink_disk peg2)
   deleted: (on yellow_disk pink_disk) (clear peg2)
   added: (clear pink_disk) (on yellow_disk peg2)
   goals met: 4 of 6
50. (move pink_disk green_disk red_disk)
   deleted: (on pink_disk green_disk) (clear red_disk)
   added: (clear green_disk) (on pink_disk red_disk)
   goals met: 3 of 6
51. (move yellow_disk peg2 pink_disk)
   deleted: (on yellow_disk peg2) (clear pink_disk)
   added: (clear peg2) (on yellow_disk pink_disk)
   goals met: 4 of 6
52. (move green_disk blue_disk peg2)
   deleted: (on green_disk blue_disk) (clear peg2)
   added: (clear blue_disk) (on green_disk peg2)
   goals met: 3 of 6
53. (move yellow_disk pink_disk blue_disk)
   deleted: (on yellow_disk pink_disk) (clear blue_disk)
   added: (clear pink_disk) (on yellow_disk blue_disk)
   goals met: 2 of 6
54. (move pink_disk red_disk green_disk)
   deleted: (on pink_disk red_disk) (clear green_disk)
   added: (clear red_disk) (on pink_disk green_disk)
   goals met: 3 of 6
55. (move yellow_disk blue_disk pink_disk)
   deleted: (on yellow_disk blue_disk) (clear pink_disk)
   added: (clear blue_disk) (on yellow_disk pink_disk)
   goals met: 4 of 6
56. (move blue_disk peg1 red_disk)
   deleted: (on blue_disk peg1) (clear red_disk)
   added: (clear peg1) (on blue_disk red_disk)
   goals met: 5 of 6
57. (move yellow_disk pink_disk blue_disk)
   deleted: (on yellow_disk pink_disk) (clear blue_disk)
   added: (clear pink_disk) (on yellow_disk blue_disk)
   goals met: 4 of 6
58. (move pink_disk green_disk peg1)
   deleted: (on pink_disk green_disk) (clear peg1)
   added: (clear green_disk) (on pink_disk peg1)
   goals met: 3 of 6
59. (move yellow_disk blue_disk pink_disk)
   deleted: (on yellow_disk blue_disk) (clear pink_disk)
   added: (clear blue_disk) (on yellow_disk pink_disk)
   goals met: 4 of 6
60. (move green_disk peg2 blue_disk)
   deleted: (on green_disk peg2) (clear blue_disk)
   added: (clear peg2) (on green_disk blue_disk)
   goals met: 5 of 6
61. (move yellow_disk pink_disk peg2)
   deleted: (on yellow_disk pink_disk) (clear peg2)
   added: (clear pink_disk) (on yellow_disk peg2)
   goals met: 4 of 6
62. (move pink_disk peg1 green_disk)
   deleted: (on pink_disk peg1) (clear green_disk)
   added: (clear peg1) (on pink_disk green_disk)
   goals met: 5 of 6
63. (move yellow_disk peg2 pink_disk)
   deleted: (on yellow_disk peg2) (clear pink_disk)
   added: (clear peg2) (on yellow_disk pink_disk)
   goals met: 6 of 6
